# Даны 2 числа a и b. Получить их сумму, разность и произведение

a = 123
b = 322
summ = a + b
difference_of_number_a = a - b
difference_of_number_b = b - a
product_of_numbers = a * b
print(f'Сумма a + b = {summ}')
print(f'Разность a - b = {difference_of_number_a}')
print(f'Разность b - a = {difference_of_number_b}')
print(f'Произведение a * b = {product_of_numbers}')


# # Не понял формулировку: "Все начальные данные задаются произвольно. поэтому тут вариант с вводом от пользоваетля"
# try:
#     a = float(input('a= '))
# except ValueError:
#     print('Введен неверный тип данных для a, доступны только числа')
# else:
#     try:
#         b = float(input('b= '))
#     except ValueError:
#         print('Введен неверный тип данных для b, доступны только числа')
#     else:
#         summ = a + b
#         difference_of_number_a = a - b
#         difference_of_number_b = b - a
#         product_of_numbers = a * b
#         print(f'Сумма a + b = {summ}')
#         print(f'Разность a - b = {difference_of_number_a}')
#         print(f'Разность b - a = {difference_of_number_b}')
#         print(f'Произведение a * b = {product_of_numbers}')
